## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:47" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:47" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:5847534b0f6f90c95d741246ae1644798fb35c6b794b885579507e2da059003d" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:cc10ecafb716fa66d91c6ea66da01398cd1158ea94fc04ed763666a3414354a5"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 47 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "941a24008125db82f9a3944a10abe9e9-5" -> "03f26d9515a21efcc51fb0dc9cc27268"
        id                     = "cpfValidation.03f26d9515a21efcc51fb0dc9cc27268.zip"
        tags                   = {}
      ~ version_id             = "g9kQdT0WeMMGZAeuIxfO2CAcKkvvXKXi" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "b08aae30188b2349c62ad4146d6e4e5c-6" -> "f12d747e0b78b872f335428cbff9a31b"
        id                     = "excelToJson.f12d747e0b78b872f335428cbff9a31b.zip"
        tags                   = {}
      ~ version_id             = "RzAumkbeVS9xG5oooTNri_K7qguXpsBR" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "68740da25ff78d9a2f279da657d816d7-6" -> "ddeb54ae82e516ef3de8d9d510dbd5bd"
      ~ id                     = "graphql.1e50aff424afada973d824af9d2a113f.zip" -> (known after apply)
      ~ key                    = "graphql.1e50aff424afada973d824af9d2a113f.zip" -> "graphql.ddeb54ae82e516ef3de8d9d510dbd5bd.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "1e50aff424afada973d824af9d2a113f" -> "ddeb54ae82e516ef3de8d9d510dbd5bd"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "czZVrmDpT37jYmjRDBm2IMYidNxds_HG" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "484a8ffcfdca848da043aca72bde7f25" -> "d7f981d63f189b0a38e8fca204eead4f"
        id                     = "dist/200.html"
      ~ source_hash            = "484a8ffcfdca848da043aca72bde7f25" -> "d7f981d63f189b0a38e8fca204eead4f"
        tags                   = {}
      ~ version_id             = "TaAy.gSKAa1H2p5NptEhVnRR6NCDzMM4" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "97ccf3682998cbfe851d1ddc6f87f6b6" -> "66fc621b809ebe6f16b4cac150d213b9"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "97ccf3682998cbfe851d1ddc6f87f6b6" -> "66fc621b809ebe6f16b4cac150d213b9"
        tags                   = {}
      ~ version_id             = ".SJVZNbtcj3Cc4cNxHm2QqXe8pnaKe5r" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "cdbe81da4d43d288fe36724ced658a13" -> "204fe3edf2c739471fd3c41fdef4f064"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "cdbe81da4d43d288fe36724ced658a13" -> "204fe3edf2c739471fd3c41fdef4f064"
        tags                   = {}
      ~ version_id             = "3LFbfr9UXl4ESqXnZVv3WhiaBTEkHrJf" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "484a8ffcfdca848da043aca72bde7f25" -> "d7f981d63f189b0a38e8fca204eead4f"
        id                     = "dist/index.html"
      ~ source_hash            = "484a8ffcfdca848da043aca72bde7f25" -> "d7f981d63f189b0a38e8fca204eead4f"
        tags                   = {}
      ~ version_id             = "wVNVpURkOn8WiXl1ccH.58ANL1jP8drS" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.66aff34e.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyAgenciesPage.66aff34e.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "c89670776769aaab8c506fc421e1a940" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyAgenciesPage.66aff34e.chunk.js" -> null
-       key                    = "dist/static/js/AgencyAgenciesPage.66aff34e.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.66aff34e.chunk.js" -> null
-       source_hash            = "c89670776769aaab8c506fc421e1a940" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Sd_pKZ53l4nCQUxY8ds2Ru2sy2k7cz5U" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.66aff34e.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyAgenciesPage.66aff34e.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "55d3003fc652eef3fccd962d62d4f328" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyAgenciesPage.66aff34e.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyAgenciesPage.66aff34e.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.66aff34e.chunk.js.LICENSE.txt" -> null
-       source_hash            = "55d3003fc652eef3fccd962d62d4f328" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "GCMCH09XwxgQ.NHlhiDIodJFWfYegEh_" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.d476831e.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "94e8c5c9da4bb7eee23f8aee7189ad8d"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyAgenciesPage.d476831e.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.d476831e.chunk.js"
+       source_hash            = "94e8c5c9da4bb7eee23f8aee7189ad8d"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyAgenciesPage.d476831e.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "55d3003fc652eef3fccd962d62d4f328"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyAgenciesPage.d476831e.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyAgenciesPage.d476831e.chunk.js.LICENSE.txt"
+       source_hash            = "55d3003fc652eef3fccd962d62d4f328"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.141ec034.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyEditAgencyPage.141ec034.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "c0e70b0c850bb33d1fa90fac69bbd5b3" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyEditAgencyPage.141ec034.chunk.js" -> null
-       key                    = "dist/static/js/AgencyEditAgencyPage.141ec034.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.141ec034.chunk.js" -> null
-       source_hash            = "c0e70b0c850bb33d1fa90fac69bbd5b3" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "rJCQgQgH0lKFBEGCtJtbxbLyfSBkXGaB" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.141ec034.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyEditAgencyPage.141ec034.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "4e11d0eec7753fcebe4544ba4612e69d" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyEditAgencyPage.141ec034.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyEditAgencyPage.141ec034.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.141ec034.chunk.js.LICENSE.txt" -> null
-       source_hash            = "4e11d0eec7753fcebe4544ba4612e69d" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "EyXmet3_UDgtbtFgj.F1e5iMBAvjWfuf" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.15ee33fa.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "43c598b1a024d9d02ddf16db3b98307c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyEditAgencyPage.15ee33fa.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.15ee33fa.chunk.js"
+       source_hash            = "43c598b1a024d9d02ddf16db3b98307c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyEditAgencyPage.15ee33fa.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "4e11d0eec7753fcebe4544ba4612e69d"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyEditAgencyPage.15ee33fa.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyEditAgencyPage.15ee33fa.chunk.js.LICENSE.txt"
+       source_hash            = "4e11d0eec7753fcebe4544ba4612e69d"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.2d788207.chunk.js"] will be destroyed
  # (because key ["static/js/AgencyNewAgencyPage.2d788207.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "4e8a7c41a91fcc059642be678d5418df" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyNewAgencyPage.2d788207.chunk.js" -> null
-       key                    = "dist/static/js/AgencyNewAgencyPage.2d788207.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.2d788207.chunk.js" -> null
-       source_hash            = "4e8a7c41a91fcc059642be678d5418df" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "huiDoy4fwTt8Dh2myXzrFB5bDjnAESs_" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.2d788207.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/AgencyNewAgencyPage.2d788207.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "16eb506bb04b8649c6a08c630eab671b" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/AgencyNewAgencyPage.2d788207.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/AgencyNewAgencyPage.2d788207.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.2d788207.chunk.js.LICENSE.txt" -> null
-       source_hash            = "16eb506bb04b8649c6a08c630eab671b" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "vnNy_NJZ22vKWR4lvPbTjfta5w5sU91f" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.81b6daa8.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "3411859ebcb21c8d168056519cbd5ed8"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyNewAgencyPage.81b6daa8.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.81b6daa8.chunk.js"
+       source_hash            = "3411859ebcb21c8d168056519cbd5ed8"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/AgencyNewAgencyPage.81b6daa8.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "16eb506bb04b8649c6a08c630eab671b"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/AgencyNewAgencyPage.81b6daa8.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/AgencyNewAgencyPage.81b6daa8.chunk.js.LICENSE.txt"
+       source_hash            = "16eb506bb04b8649c6a08c630eab671b"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.6d515f9d.chunk.js"] will be destroyed
  # (because key ["static/js/LoginPage.6d515f9d.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "a6b36db5d237305f365a2ae2e9565ba9" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/LoginPage.6d515f9d.chunk.js" -> null
-       key                    = "dist/static/js/LoginPage.6d515f9d.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.6d515f9d.chunk.js" -> null
-       source_hash            = "a6b36db5d237305f365a2ae2e9565ba9" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "jj9JYyrLrzbTK60PzV241jjX096y.bdd" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.6d515f9d.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/LoginPage.6d515f9d.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "0cb98b03c5f49de681bca973ccc95978" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/LoginPage.6d515f9d.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/LoginPage.6d515f9d.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.6d515f9d.chunk.js.LICENSE.txt" -> null
-       source_hash            = "0cb98b03c5f49de681bca973ccc95978" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "feqPSX6TbR710Zahl70XcNSYrN3piX6m" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.ce5d2852.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "d35d6729fe80d202a72c7a7f486fca5c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/LoginPage.ce5d2852.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.ce5d2852.chunk.js"
+       source_hash            = "d35d6729fe80d202a72c7a7f486fca5c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/LoginPage.ce5d2852.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "1c3724504da78b38a9bc42001869285f"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/LoginPage.ce5d2852.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/LoginPage.ce5d2852.chunk.js.LICENSE.txt"
+       source_hash            = "1c3724504da78b38a9bc42001869285f"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.bed97733.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "2acf787af5dd8fd9f456df7292b6ef2d"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadNewUploadPage.bed97733.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.bed97733.chunk.js"
+       source_hash            = "2acf787af5dd8fd9f456df7292b6ef2d"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.bed97733.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "cc27fa172211f2877b50629ac7228a71"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadNewUploadPage.bed97733.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.bed97733.chunk.js.LICENSE.txt"
+       source_hash            = "cc27fa172211f2877b50629ac7228a71"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.c1bfb54d.chunk.js"] will be destroyed
  # (because key ["static/js/UploadNewUploadPage.c1bfb54d.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "77ffd8be9dd1b2f5f8dddae0a301303a" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadNewUploadPage.c1bfb54d.chunk.js" -> null
-       key                    = "dist/static/js/UploadNewUploadPage.c1bfb54d.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.c1bfb54d.chunk.js" -> null
-       source_hash            = "77ffd8be9dd1b2f5f8dddae0a301303a" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "ZTFoYW6.yWAZMOWH1GXXlGPpVTkxDWfa" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadNewUploadPage.c1bfb54d.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadNewUploadPage.c1bfb54d.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "cc27fa172211f2877b50629ac7228a71" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadNewUploadPage.c1bfb54d.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadNewUploadPage.c1bfb54d.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadNewUploadPage.c1bfb54d.chunk.js.LICENSE.txt" -> null
-       source_hash            = "cc27fa172211f2877b50629ac7228a71" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "J7ukhliFiHZpjU6.Yk2kT_9hxjbLOFeU" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.38b5f1bf.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "ecdccd99d5f9de5caca96bb15aa95509"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserEditUserPage.38b5f1bf.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.38b5f1bf.chunk.js"
+       source_hash            = "ecdccd99d5f9de5caca96bb15aa95509"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.38b5f1bf.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "63401d07fb99a2c1ff4404567f6b3ec5"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserEditUserPage.38b5f1bf.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.38b5f1bf.chunk.js.LICENSE.txt"
+       source_hash            = "63401d07fb99a2c1ff4404567f6b3ec5"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.cc722f7f.chunk.js"] will be destroyed
  # (because key ["static/js/UserEditUserPage.cc722f7f.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "e41a01dd54a3e9023b638528bcb2bfa6" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserEditUserPage.cc722f7f.chunk.js" -> null
-       key                    = "dist/static/js/UserEditUserPage.cc722f7f.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.cc722f7f.chunk.js" -> null
-       source_hash            = "e41a01dd54a3e9023b638528bcb2bfa6" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "735GvB5HPmgDpPqZa6HZfurhcw27AzDl" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserEditUserPage.cc722f7f.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UserEditUserPage.cc722f7f.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "63401d07fb99a2c1ff4404567f6b3ec5" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserEditUserPage.cc722f7f.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UserEditUserPage.cc722f7f.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserEditUserPage.cc722f7f.chunk.js.LICENSE.txt" -> null
-       source_hash            = "63401d07fb99a2c1ff4404567f6b3ec5" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "WRgdou6baMt.Vl5N6PFJLxbD_._2TaDe" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserNewUserPage.6988a61a.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "ebff79afa26679b041161de19a19225e"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserNewUserPage.6988a61a.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserNewUserPage.6988a61a.chunk.js"
+       source_hash            = "ebff79afa26679b041161de19a19225e"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserNewUserPage.6988a61a.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "8323bdf2524d967917b1d59b40ac09ac"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserNewUserPage.6988a61a.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserNewUserPage.6988a61a.chunk.js.LICENSE.txt"
+       source_hash            = "8323bdf2524d967917b1d59b40ac09ac"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserNewUserPage.887f24f7.chunk.js"] will be destroyed
  # (because key ["static/js/UserNewUserPage.887f24f7.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "caddef79342b116bc0c69580ad937c0d" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserNewUserPage.887f24f7.chunk.js" -> null
-       key                    = "dist/static/js/UserNewUserPage.887f24f7.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserNewUserPage.887f24f7.chunk.js" -> null
-       source_hash            = "caddef79342b116bc0c69580ad937c0d" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "UdlshdLlArLVQXwiX914Y6cNqqDsdwld" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserNewUserPage.887f24f7.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UserNewUserPage.887f24f7.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "8323bdf2524d967917b1d59b40ac09ac" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserNewUserPage.887f24f7.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UserNewUserPage.887f24f7.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserNewUserPage.887f24f7.chunk.js.LICENSE.txt" -> null
-       source_hash            = "8323bdf2524d967917b1d59b40ac09ac" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "mas5IhW_W6fzOv3sgYsLk7EB7f.AumcP" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.80c817aa.chunk.js"] will be destroyed
  # (because key ["static/js/UserUsersPage.80c817aa.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "d8f1725f33054825ed74028a8031c26b" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserUsersPage.80c817aa.chunk.js" -> null
-       key                    = "dist/static/js/UserUsersPage.80c817aa.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.80c817aa.chunk.js" -> null
-       source_hash            = "d8f1725f33054825ed74028a8031c26b" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "oTXn.ORkVorpn7d00gPM5ydwodFWROrK" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.80c817aa.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UserUsersPage.80c817aa.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "c6fdde5760bf5d008d4ac72ddd13b210" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UserUsersPage.80c817aa.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UserUsersPage.80c817aa.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.80c817aa.chunk.js.LICENSE.txt" -> null
-       source_hash            = "c6fdde5760bf5d008d4ac72ddd13b210" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "tfYDr_uMLh6z6dsAkFPiYfzUDRFfchuq" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.8b561aee.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "df4d2e13600cd587c74c98ca1522c09e"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserUsersPage.8b561aee.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.8b561aee.chunk.js"
+       source_hash            = "df4d2e13600cd587c74c98ca1522c09e"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UserUsersPage.8b561aee.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "c6fdde5760bf5d008d4ac72ddd13b210"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UserUsersPage.8b561aee.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UserUsersPage.8b561aee.chunk.js.LICENSE.txt"
+       source_hash            = "c6fdde5760bf5d008d4ac72ddd13b210"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.1da0dff4.js"] will be destroyed
  # (because key ["static/js/app.1da0dff4.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "efba588130d89b790944c37f133dd5b3" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.1da0dff4.js" -> null
-       key                    = "dist/static/js/app.1da0dff4.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.1da0dff4.js" -> null
-       source_hash            = "efba588130d89b790944c37f133dd5b3" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "g3r2vA9iuuq8zcqt3wi.aMBemyTgc7xH" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.1da0dff4.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.1da0dff4.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "9806104531a6dc74425d37448a95fecc" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.1da0dff4.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.1da0dff4.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.1da0dff4.js.LICENSE.txt" -> null
-       source_hash            = "9806104531a6dc74425d37448a95fecc" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "xA6EcCx5yV3sq5sJagb_J7pHX9XGOzXC" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.34feff28.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "81fd8a9ab0f6cd5b5d5eec64d16f507f"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.34feff28.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.34feff28.js"
+       source_hash            = "81fd8a9ab0f6cd5b5d5eec64d16f507f"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.34feff28.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "4e6c11cb01bf2c824be6b521ac1f730a"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.34feff28.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.34feff28.js.LICENSE.txt"
+       source_hash            = "4e6c11cb01bf2c824be6b521ac1f730a"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.807bf683.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "2d8bd7a584f7eaa16434f8db070742b0"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.807bf683.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.807bf683.js"
+       source_hash            = "2d8bd7a584f7eaa16434f8db070742b0"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.a5dd511e.js"] will be destroyed
  # (because key ["static/js/runtime-app.a5dd511e.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "f8bfbc4f93eeb771cbb476320a90b9b9" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.a5dd511e.js" -> null
-       key                    = "dist/static/js/runtime-app.a5dd511e.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.a5dd511e.js" -> null
-       source_hash            =...*[Comment body truncated]*